// - Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

let str = ['a', 'b', 'c'];
let num = [1,2,3];

let res = str.concat(num);

console.log(res);

// - Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
// - Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
// - Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// - Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// - Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент при помощи shift
// - Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент при помощи pop
// - slice. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// - slice. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы

// Все робити через функції масивів (foreach, map ...тд)
//
// 1 створити масив з 10 елементів, заповнити його парними значеннями (2 4 6 8 10 ...).
// 2 створити масив з 10 елементів, заповнити його цілими рандомними значеннями(Math.random)
//
// 3 є масив
//
// let users = [
//     {name: 'vasya', age: 31, status: false},
//     {name: 'petya', age: 30, status: true},
//     {name: 'kolya', age: 29, status: true},
//     {name: 'olya', age: 28, status: false},
//     {name: 'max', age: 30, status: true},
//     {name: 'anya', age: 31, status: false},
//     {name: 'oleg', age: 28, status: false},
//     {name: 'andrey', age: 29, status: true},
//     {name: 'masha', age: 30, status: true},
//     {name: 'olya', age: 31, status: false},
//     {name: 'max', age: 31, status: true}
// ];
// - відсортувати його за  віком (зростання , а потім окремо спадання)
// - відсортувати його за кількістю знаків в імені  (зростання , а потім окремо спадання)